Revit 2026 API

# ZoneAddSpaces Method

---

**Note: This API is now obsolete.**

Add a set of existing spaces to Zone element.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object instead.")]
public bool AddSpaces(
	SpaceSet spaces
)
```
```vb
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object instead.")>
Public Function AddSpaces (
	spaces As SpaceSet
) As Boolean
```
```cpp
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object instead.")]
bool AddSpaces(
	SpaceSet^ spaces
)
```
```fsharp
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object instead.")>]
member AddSpaces :
        spaces : SpaceSet -> bool
```

#### Parameters

spaces SpaceSet
     The spaces which want to add to zone element.

#### Return Value

Boolean If successful the current zone element will add a set of input spaces, otherwise .

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the specified parameter Value is . |
| InvalidOperationException | Thrown when the input spaces cannot be added to current zone element. |

#### Reference

Zone Class

Autodesk.Revit.DB.Mechanical Namespace